{
  "exception": {
    "impl": "La implementación usada no puede crear controles LocatorControl.",
    "impl_infocatastro": "La implementación usada no puede crear controles InfoCatastroControl.",
    "impl_xylocator": "La implementación usada no puede crear controles XYLocatorControl.",
    "impl_ignsearchlocator": "La implementación usada no puede crear controles IGNSearchLocatorControl.",
    "no_controls": "El plugin Locator necesita activar al menos un control.",
    "wrong_coords": "Las coordenadas introducidas no son correctas.",
    "transforming": "Error realizando la transformación.",
    "wrong_values": "Algún valor introducido no es correcto. Recuerda que los minutos y los segundos tienen que tener un valor entre 0 y 59 y los grados entre 0 y 180.",
    "mapeaerror": "No es posible establecer la conexión con el servidor de Catastro.",
    "no_province": "Debe seleccionar una provincia.",
    "no_mun": "Debe seleccionar un municipio.",
    "no_polygon": "Debe seleccionar un polígono.",
    "no_parcel": "Debe seleccionar una parcela.",
    "json_invalid": "La respuesta no es un JSON válido:",
    "no_refcatastro": "Debe introducir una referencia catastral.",
    "noInfo": "PARA ESAS COORDENADAS NO HAY REFERENCIA DISPONIBLE",
    "noresults": "No se han encontrado resultados",
    "no_direction": "No existe dirección",
    "error_findjsonp": "Error en la petición del servicio findJSONp.",
    "error_candidates": "Error en la petición del servicio candidatesJSONp."
  },
  "textHelp": {
    "help1": "La extensión de búsqueda de lugares permite encontrar sitios por coordenadas o al revés, coordenadas y sitios en el mapa mediante la introducción de texto.",
    "help2": "Esta extensión es personalizable mediante parámetros, por lo que la extensión puede cambiar de un visualizador a otro.",
    "help3": "La extensión se compone de varios controles:",
    "help4": "El control de búsqueda por lugares. Es una fachada del geocodificador de Cartociudad (https://www.idee.es/resources/documentos/Cartociudad/CartoCiudad_ServiciosWeb.pdf), que permite realizar dos tipos de búsquedas:",
    "help5": "Por texto, por ejemplo, si queremos buscar la Calle mayor de Pamplona:",
    "help6": "Al buscar, nos aparecen varias alternativas. En este caso buscamos la primera. Al hacer click sobre la opción uno, nos lleva a la calle marcando la geometría:",
    "help7": "Por coordenadas, activando la herramienta de obtener dirección por punto del mapa, el cursor nos cambiará a una chincheta. Haciendo click sobre un punto del mapa, nos devuelve la información asociada a ese punto:",
    "help8": "El siguiente control es la búsqueda mediante catastro y se compone de dos herramientas:",
    "help9": "La primera de ellas permite buscar una parcela mediante provincia, municipio, polígono y parcela:",
    "help10": "La segunda permite la búsqueda por referencia catastral o consultar la referencia catastral por un punto.",
    "help11": "Por ejemplo, si queremos buscar la referencia catastral '0910001QD3101S':",
    "help12": "O el caso contrario, si quisiéramos saber la referencia catastral de un punto del mapa:",
    "help13": "Por último, el control de búsqueda de un punto, permite introducir la longitud y latitud de un punto y obtenerlo en el mapa. Por ejemplo para longitud -3,43556 y latitud 40,938274 :",
    "help14": "La información relevante a la extensión y su posible parametrización está documentada en",
    "help15": "El ejemplo de uso de sus parámetros puede comprobarse en"
  },
  "tooltip": "Buscar un lugar",
  "xylocator": "Buscar por coordenadas",
  "geographic": "Geográficas",
  "zone": "huso",
  "dms": "GMS",
  "dd": "GD",
  "srs": "Sistema de coordenadas",
  "longitude": "Longitud",
  "latitude": "Latitud",
  "locate": "Localizar",
  "clean": "Eliminar",
  "north": "Norte",
  "south": "Sur",
  "east": "Este",
  "west": "Oeste",
  "infocatastro": "Buscar parcela/catastro",
  "plot": "Parcela",
  "searchplot": "Buscar parcela",
  "searchcadastre": "Buscar catastro",
  "province": "Provincia",
  "selectprov": "Seleccione provincia",
  "municipality": "Municipio",
  "selectmuni": "Seleccione municipio",
  "estate": "Polígono",
  "search": "Buscar",
  "refCastatro": "Referencia catastral",
  "insertCadastre": "Insertar catastro",
  "notaRef": "Código de parcela (14 primeros dígitos). Ej.9977715VK3797F (edificio del IGN)",
  "consultReference": "Consultar Referencia",
  "exact": "Dirección exacta",
  "aprox": "Dirección aproximada",
  "cadastral_information": "Información catastral",
  "reference": "Referencia catastral",
  "description": "Descripción",
  "noReference": "No hay referencia",
  "ignsearch": "Buscar por lugares",
  "search_direction": "Topónimo, dirección o código postal",
  "get_direction": "Obtener dirección en un punto del mapa",
  "toponimo": "Toponimo"
}