{
   "exception":{
      "impl":"The implementation used cannot create StyleManager controls.",
      "geomNotSupported":"Geometry not supported",
      "attributeAdded":"Attribute has already been added.",
      "repeatedVariable":"Repeated variable name",
      "variableName":"No variable with that name exists.",
      "incorrectName":"Incorrect variable name.",
      "emptyString":"It is not allowed to enter an empty string.",
      "emptyVariable":"Empty variable name.",
      "moreColorsRanges":"There cannot be more colors than ranges.",
      "numberColors":"Incorrect number of colors.",
      "chooseStyle":"You must choose at least one style",
      "choStyle":"Choose style",
      "layerNoFeaturesLoad":"The layer has no features or they have not been loaded yet.",
      "chooseLayer":"You have to choose a layer",
      "choLayer":"Choose layer",
      "numberColorAllowed":"You have reached the maximum number of colors allowed",
      "information":"Information"
   },
   "textHelp": {
      "help1": "The cartographic style management extension allows you to create styles for vector layers loaded in a viewer.",
      "help2": "In the extension panel you can see two different parts: the simple symbology part, which allows you to apply different styles to the entire layer, and the advanced part, which allows you to apply more complex styles such as flow lines, clusters, maps of heat, categorical, choropleth, proportional symbology or statistical symbology.",
      "help3": "The first 4 buttons of the panel are; the vector layer selector (yellow), apply style to the layer (orange), reset to the default style (blue) and copy style (green). This last button will be discussed later.",
      "help4": "In the simple symbolization part, it is organized in fill, where you can apply the fill color of the layer's geographic objects and their opacity, for example orange at 90% opacity:",
      "help5": "also allows you to add a surface pattern to the fill by checking the 'pattern' box. In the example, a green brick pattern is associated:",
      "help6": "In the stroke part, the border color of the layer geometries is assigned:",
      "help7": "you can also assign linear spacing to the border by adding values in 'Linedash', for example:",
      "help8": "also allows you to apply patterns to the edges of geometries by activating the 'pattern' option",
      "help9": "The next section is the labeling of the geometries displayed on the layer, it allows you to select the font type, color, size, alignment, enable rotation with the map or not and the initial rotation:",
      "help10": "also allows you to style the labels' stroke:",
      "help11": "In the case of specific layers, pictorial symbology can be added either in Source format or through an image. If it is in image format, icon is selected. In the 'icon' section there is the URL parameter, where you can add the URL of an image (If it is SVG, it will allow style changes later).",
      "help12": "In addition you can select size, where the image anchor should go, offset, image scale, enable rotation next to the map, initial rotation and opacity.",
      "help13": "For the example we will use: https://componentes.cnig.es/api-core/assets/svg/circleIcons/accidenteGeografico.svg :",
      "help14": "if you have an SVG, by clicking on 'Modify SVG', you can change the border and padding of the image:",
      "help15": "If you choose the 'Source' option, an internal icon will be added to the point geometry:",
      "help16": "To do this, you can choose a shape of the icon, a family (which allows you to add another icon internally), the radius of the shape, the size of the inner icon, the color, if you want with a gradient, the offset, opacity and enable icon rotation next to the initial rotation.",
      "help17": "Up to this point the simple cartographic styles would be explained, which are those that are applied to the entire layer in general.",
      "help18": "Advanced cartographic styles use geomatic algorithms for the representation of the layer, so that each geometry of the chain is represented in a different way, being able to represent different attributes or shapes, which allows us to associate features of reality with the style associated with a layer.",
      "help19": "Flow lines (or Sankey diagrams) allow you to associate a value and a color at the beginning and end of the line, which visually leads to a gradient showing a loss or increase in value as the line is traversed One of the most famous is the flow map of the Napoleonic invasion of Russia (https://es.wikipedia.org/wiki/Sankey_Diagram#/media/File:Minard.png)",
      "help20": "To create it, you will have to select the start and end colors, the start and end values and the type, offset and color of the arrow",
      "help21": "The grouping or 'cluster' allows geometries to be grouped together, representing the number of them that are at a given distance and at an interval of number of geometries per group.", "help22": "To create it, you must choose the number of ranges (how many geometries will be in each group), the fill and border color, along with the radius, width and opacity. In addition, you can show the envelope of each group if you hover the mouse over the group, You can display the quantity, you can select to display each geometry contained in the group and you can animate the transitions between zooms of the viewer. Finally, you can parameterize the distance at which a group will be created and the text of the quantity to be displayed. .",
      "help23": "Heat maps allow you to represent the density or distribution of geometries in an area of the territory or their weighting by an attribute.",
      "help24": "For its creation, if you want to weight by an attribute, you choose its name, the choice of colors for the heat map representation gradient, the blur size and the radius.", "help25": "The categorical style allows qualitative attributes to be represented using the visual variable of color and tone. It represents each geometry with a different tone depending on its attribute.",
      "help26": "To use it, choose the categorical attribute and if you want to customize a specific value, click on the value and select its style.",
      "help27": "The choropleth style allows representing quantitative values associated with geometries, through the visual variable of color, value.",
      "help28": "To use it, you will have to choose the quantitative tribute, the interval grouping algorithm, the number of ranges and the colors of the color ramp.",
      "help29": "The interval grouping algorithms are: quantile (the limits of each interval are made in equal parts from the maximum and minimum value), equal intervals (each group of intervals have the same geometries), natural break (the limits are associated according to the internal groupings of the data according to their histogram) by arithmetic or geometric progression (the limits of the interval are associated according to these mathematical progressions) and by mean-sigma (the intervals are associated using the statistics of the mean and the standard deviation)",
      "help30": "Proportional symbology allows a quantitative value to be associated with a radius, showing higher values at larger radii.",
      "help31": "To use it, choose the quantitative attribute, the scale (absolute or with Flannery compensation) and the maximum and minimum representation radii.",
      "help32": "Finally, statistical symbology allows you to represent more than one quantitative attribute in a statistical graph.",
      "help33": "The chart types offered are: tard, 3D tard, donut and bar chart.",
      "help34": "Apart from the type of graph, you can choose the color ramp to use in the graph, an offset on the X and Y axes and the radius of the graph.",
      "help35": "In addition, for each added attribute, the label and its style can be displayed.",
      "help36": "Finally, in the case of copying a style from the copy button in the extension header, it can be used both to load styles to a layer at the javascript object level or by apirest.",
      "help37": "To apply a serialized style to a layer in javascript you can follow the following workflow explained in the styles documentation: https://github.com/IGN-CNIG/API-CNIG/wiki/2.1. 2.-Symbolization%C3%B3n#serialization%C3%B3n-of-vector-styles",
      "help38": "In the case of use by api-rest, starting from:",
      "help39": "You can add the copied style at the end:",
      "help40": "Leaving the following URL:",
      "help41": "The information relevant to the extension and its possible parameterization is documented in",
      "help42": "The example of use of its parameters can be checked in"
   },
   "selectLayer":"Select a layer...",
   "applyStyle":"Apply Style",
   "clearStyle":"Clear Style",
   "symbology":"Symbology",
   "heatMap":"Heat Map",
   "category":"Category",
   "choropleths":"Choroplet",
   "proportional":"Proportional",
   "statistic":"Statistics",
   "attributeValue":"Attribute Value",
   "preview":"Preview",
   "others":"Others",
   "type":"Type",
   "options":"Options",
   "pointOptions":"Point Options",
   "lineOptions":"Line Options",
   "polygonOptions":"Polygon Options",
   "opacity":"Opacity",
   "radius":"Radius",
   "width":"Width",
   "pattern":"Pattern",
   "size":"Size",
   "space":"Space",
   "rotation":"Rotation",
   "scale":"Scale",
   "none":"None",
   "text":"Text",
   "font":"Font",
   "horizontalAlignment":"Horizontal Alignment",
   "verticalAlignment":"Vertical Alignment",
   "enableRotation":"Enable rotation with the map",
   "fitGeometry":"Fit Geometry",
   "minimumWidth":"Minimum Width",
   "smooth":"Smooth",
   "overflow":"Overflow",
   "hidden":"Hidden",
   "visible":"Visible",
   "ellipsis":"Ellipsis",
   "labelStroke":"Label Stroke",
   "label":"Stroke",
   "anchorage":"Anchorage",
   "form":"Form",
   "family":"Family",
   "iconSize":"Icon size",
   "gradient":"Gradient",
   "iconColor":"Icon Color",
   "legend":"Legend",
   "showLabel":"Show Label",
   "fill":"Fill",
   "border":"Border",
   "bulk":"Thickness",
   "attributes":"Attributes",
   "attribute":"Attribute",
   "minimumRadius":"Minimum radius",
   "maximumRadius":"Maximum Radius",
   "addColor":"Add Color",
   "blur":"Blur",
   "ranks":"Ranks",
   "rank":"Rank",
   "numberRanks":"Number of ranks",
   "since":"Since",
   "until":"Until",
   "envelope":"Envelope",
   "quantity":"Quantity",
   "selectable":"Selectable",
   "animated":"Animated",
   "distance":"Distance",
   "points":"Points",
   "fanDistance":"Fan Distance",
   "textColor":"Text Color",
   "algorithm":"Algorithm",
   "arithmeticProgression":"Arithmetic Progression",
   "equalIntervals":"Equal Intervals",
   "geometricProgression":"Geometric Progression",
   "meanSigma":"Mean Sigma",
   "naturalBreaks":"Natural Breaks",
   "quantile":"Quantile",
   "colorRamp":"Color Ramp",
   "initial":"Initial",
   "final":"Final",
   "cake":"Cake",
   "tDcake":"3D Cake",
   "donut":"Donut",
   "graphic":"Graphic",
   "classic":"Classic",
   "dark":"Dark",
   "pale":"Pale",
   "neon":"Neon",
   "pie":"Cake",
   "xAxis":"X axis",
   "yAxis":"Y axis",
   "addAttribute":"Add Attribute",
   "bevel":"Bezel",
   "miter":"Miter",
   "rounded":"Rounded",
   "extreme":"Extreme",
   "square":"Square",
   "labelText":"Label",
   "icon":"Icon",
   "stroke":"Stroke",
   "center":"Center",
   "justified":"Justified",
   "left":"Left",
   "right":"Right",
   "alphabetical":"Alphabetical",
   "down":"Down",
   "hanging":"Hanging",
   "ideographic":"Ideographic",
   "up":"Up",
   "patternOptions":"Pattern options",
   "adjust":"Adjust",
   "ranges":"Ranges",
   "flowLine":"Flowline",
   "absolute": "Absolute",
   "arrow": "Arrow",
   "arrowColor": "Arrow color",
   "generateSerialized": "Generate serialized style",
   "serializedStyle": "Serialized style",
   "clipboard": "Copied serialized style to clipboard",
   "modifySVG": "Modify SVG",
   "infoURL": "A gallery of SVG files is available at <a target='blank' href='https://componentes.cnig.es/api-core/api/actions/resources/svg'>https://componentes.cnig.es/api-core/api/actions/resources/svg</a>",
   "tooltip": "Style manager"
}