{
   "exception":{
      "impl":"La implementación usada no puede crear controles StyleManager.",
      "geomNotSupported":"Geometría no soportada",
      "attributeAdded":"El atributo ya se ha agregado.",
      "repeatedVariable":"Nombre de variable repetido",
      "variableName":"No existe ninguna variable con ese nombre.",
      "incorrectName":"Nombre de variable incorrecto.",
      "emptyString":"No está permitido introducir una cadena vacía.",
      "emptyVariable":"Nombre de variable vacía.",
      "moreColorsRanges":"No pueden existir más colores que rangos.",
      "numberColors":"Número de colores incorrecto.",
      "chooseStyle":"Debe elegir al menos un estilo",
      "choStyle":"Elija estilo",
      "layerNoFeaturesLoad":"La capa no tiene features o aún no se han cargado.",
      "chooseLayer":"Tiene que elegir una capa",
      "choLayer":"Elija capa",
      "numberColorAllowed":"Ha llegado al número máximo de colores permitidos",
      "information":"Información"
   },
   "textHelp": {
      "help1": "La extensión de gestión de estilos cartográficos permite crear estilos a las capas vectoriales cargadas en un visualizador.",
      "help2": "En el panel de la extensión se aprecian dos partes diferenciadas: la de simbología simple, que permite aplicar distintos estilos a toda la capa y avanzada, permitiendo aplicar estilos más complejos como líneas de flujo, agrupaciones (clusters), mapas de calor, categóricos, coropletas, simbología proporcional o simbología estadística.",
      "help3": "Los 4 primeros botones del panel son; el selector de capa vectorial (amarillo), aplicar estilo a la capa (naranja), reiniciar al estilo por defecto (azul) y copiar estilo (verde). De este último botón se hablará más adelante.",
      "help4": "En la parte de simbolización simple, se organiza en relleno, donde se puede aplicar el color de relleno de los objetos geográficos de la capa y su opacidad, por ejemplo naranja al 90% de opacidad:",
      "help5": "también permite añadir un patrón superficial al relleno marcando la casilla de 'patrón'. En el ejemplo, se asocia un patrón ladrillo de color verde:",
      "help6": "En la parte de trazo, se asigna el color del borde de las geometrías de la capa:",
      "help7": "además se puede asignar un espaciado lineal al borde añadiendo valores en 'Linedash', por ejemplo:",
      "help8": "también permite aplicar patrones al borde de las geometrías activando la opción 'patrón'",
      "help9": "La siguiente sección es el etiquetado de las geometrías mostradas en la capa, permite seleccionar el tipo de fuente, color, tamaño, alineación, habilitar el giro con el mapa o no y la rotación inicial:",
      "help10": "también permite aplicar estilo al trazo de las etiquetas:",
      "help11": "En el caso de capas puntuales, se puede añadir simbología pictórica ya sea en formato Fuente o mediante una imagen. Si es en formato imagen se selecciona icono. En la sección 'icono' está el parámetro URL, donde se puede añadir la URL de una imagen (En el caso de ser SVG, permitirá cambios de estilo posteriormente).",
      "help12": "Además se puede seleccionar tamaño, dónde debe ir el anclaje de la imagen, offset, escala de la imagen, habilitar rotación junto al mapa, rotación inicial y la opacidad.",
      "help13": "Para el ejemplo se usará: https://componentes.cnig.es/api-core/assets/svg/circleIcons/accidenteGeografico.svg :",
      "help14": "en el caso de tener un SVG, haciendo click sobre 'Modificar SVG', se pueden cambiar el borde y relleno de la imagen:",
      "help15": "En el caso de elegir la opción 'Fuente', se añadirá un icono interno a la geometría puntual:",
      "help16": "Para ello, se puede elegir una forma del icono, una familia (lo que permite añadir internamente otro icono), el radio de la forma, el tamaño del icono interior, el color, si se quiere con gradiente, el offset, la opacidad y habilitar la rotación del icono junto a la rotación inicial.",
      "help17": "Hasta aquí estarían explicados los estilos cartográficos simples, que son los que se aplican a toda la capa en general.",
      "help18": "Los estilos cartográficos avanzados, utilizan algoritmia geomática para la representación de la capa, de forma que representa cada geometría de la cade de una forma distinta, pudiendo representar distintos atributos o formas, lo que permite asociar rasgos de la realidad al estilo asociado a una capa.",
      "help19": "Las líneas de flujo (o diagramas de Sankey) permiten asociar un valor y un color al inicio y al final de la línea, lo que visualmente lleva a un degradado mostrando una pérdida o aumento de valor según se recorre la línea. Uno de los más famosos es el mapa de flujo de la invasión napoleónica de Rusia (https://es.wikipedia.org/wiki/Diagrama_de_Sankey#/media/Archivo:Minard.png)",
      "help20": "Para su creación, habrá que seleccionar los colores de inicio y fin, los valores de inicio y fin y el tipo, offset y color de la flecha ",
      "help21": "La agrupación o 'cluster', permite agrupar geometrías representando la cantidad de ellas que se encuentran a una distancia dada y a un intervalo de número de geometrías por grupo.",      "help22": "Para su creación, hay que elegir el número de rangos (cuántas geometrías va a haber en cada grupo), el color de relleno y borde, junto al radio, ancho y opacidad. Además, se puede mostrar la envoltura de cada grupo si se pasa el ratón por el grupo, se puede mostrar la cantidad , se puede seleccionar para desplegar cada geometría contenida en el grupo y se puede animar las transiciones entre zooms del visualizador. Por último, se puede parametrizar la distancia a la que se creará un grupo yel texto de la cantidad a mostrar.",
      "help23": "Los mapas de calor permiten representar la densidad o distribución de geometrías en una zona del territorio o su ponderación por un atributo.",
      "help24": "Para su creación, se elige en el caso de querer ponderar por un atributo, el nombre del mismo, la elección de colores para el gradiente de representación del mapa de calor, el tamaño de difuminado y el radio.",      "help25": "El estilo categórico permite representar atributos cualitativos mediante la variable visual del color, tono. Representa cada geometría con un tono distinto según su atributo.",
      "help26": "Para su uso, se elige el atributo categórico y en el caso de querer personalizar algún valor en concreto, se haría click sobre el valor seleccionando su estilo.",
      "help27": "El estilo por coropletas, permite representar valores cuantitativos asociados a las geometrías, mediante la variable visual del color, valor.",
      "help28": "Para su uso, habrá que elegir ela tributo cuantitativo, el algoritmo de agrupación de los intervalos, el número de rangos y los colores de la rampa de color.",
      "help29": "Los algoritmos de la agrupación del intervalo son: cuantil (los límites de cada intervalo se realizan en partes iguales a partir del valor máximo y mínimo), intervalos iguales (cada grupo de intervalos tienen las mismas geometrías), ruptura natural (los límites se asocian según las agrupaciones internas de los datos según su histograma) por progresión aritmética o geométrica (los límites del intervalo se asocian según estas progresiones matemáticas) y por media-sigma (se asocian los intervalos mediante los estadísticos de la media y la desviación estándar)",
      "help30": "La simbología proporcional permite asociar a un valor cuantitativo un radio, mostrando los valores más altos a radios más grandes.",
      "help31": "Para su uso, se elige el atributo cuantitativo, la escala (absoluta o con compensación de Flannery) y los radios máximos y mínimos de representación.",
      "help32": "Por último, la simbología por estadísticos, permite representar más de un atributo cuantitativo en un gráfico estadístico.",
      "help33": "Los tipos de gráfico ofrecidos son: de tarda, tarda 3D, donut y gráfico de barras.",
      "help34": "A parte del tipo de gráfico, se puede elegir la rampa de color a usar en el gráfico,un offset en los ejes X e Y y el radio del gráfico.",
      "help35": "Además, para cada atributo añadido, se puede mostrar la etiqueta y el estilo de la misma.",
      "help36": "Por último, en el caso de copiar un estilo desde el botón de copiar de la cabecera de la extensión, se puede utilizar tanto para cargar estilos a una capa a nivel de objeto javascript como por apirest.",
      "help37": "Para aplicar un estilo serializado a una capa en javascript se puede seguir el siguiente flujo de trabajo explicado en la documentación de estilos: https://github.com/IGN-CNIG/API-CNIG/wiki/2.1.2.-Simbolizaci%C3%B3n#serializaci%C3%B3n-de-estilos-vectoriales",
      "help38": "En el caso de su utilización por api-rest, partiendo de:",
      "help39": "Se puede añadir al final el estilo copiado:",
      "help40": "Quedando la siguiente URL:",
      "help41": "La información relevante a la extensión y su posible parametrización está documentada en",
      "help42": "El ejemplo de uso de sus parámetros puede comprobarse en"
   },
   "selectLayer":"Seleccione una capa...",
   "applyStyle":"Aplicar estilo",
   "clearStyle":"Limpiar estilo",
   "symbology":"Simbología",
   "heatMap":"Mapa de calor",
   "category":"Categoría",
   "choropleths":"Coropleta",
   "proportional":"Proporcional",
   "statistic":"Estadísticos",
   "attributeValue":"Valor de atributo",
   "preview":"Previsualización",
   "others":"Otros",
   "type":"Tipo",
   "options":"Opciones",
   "pointOptions":"Opciones de punto",
   "lineOptions":"Opciones de línea",
   "polygonOptions":"Opciones de polígono",
   "opacity":"Opacidad",
   "radius":"Radio",
   "width":"Ancho",
   "pattern":"Patrón",
   "size":"Tamaño",
   "space":"Espacio",
   "rotation":"Rotación",
   "scale":"Escala",
   "none":"Ninguno",
   "text":"Texto",
   "font":"Fuente",
   "horizontalAlignment":"Alineación horizontal",
   "verticalAlignment":"Alineación vertical",
   "enableRotation":"Habilitar rotación con el mapa",
   "fitGeometry":"Ajustar a geometría",
   "minimumWidth":"Ancho Mínimo",
   "smooth":"Suavizar",
   "overflow":"Desbordar",
   "hidden":"Oculto",
   "visible":"Visible",
   "ellipsis":"Puntos suspensivos",
   "labelStroke":"Trazo de la etiqueta",
   "label":"Trazo",
   "anchorage":"Anclaje",
   "form":"Forma",
   "family":"Familia",
   "iconSize":"Tamaño icono",
   "gradient":"Gradiente",
   "iconColor":"Color de icono",
   "legend":"Leyenda",
   "showLabel":"Mostrar etiqueta",
   "fill":"Relleno",
   "border":"Borde",
   "bulk":"Grosor",
   "attributes":"Atributos",
   "attribute":"Atributo",
   "minimumRadius":"Radio mínimo",
   "maximumRadius":"Radio máximo",
   "addColor":"Añadir color",
   "blur":"Difuminado",
   "ranks":"Rangos",
   "rank":"Rango",
   "numberRanks":"Número de rangos",
   "since":"Desde",
   "until":"Hasta",
   "envelope":"Envoltura",
   "quantity":"Cantidad",
   "selectable":"Seleccionable",
   "animated":"Animado",
   "distance":"Distancia",
   "points":"Puntos",
   "fanDistance":"Distancia de abanico",
   "textColor":"Color de texto",
   "algorithm":"Algoritmo",
   "arithmeticProgression":"Progresión aritmética",
   "equalIntervals":"Intervalos iguales",
   "geometricProgression":"Progresión geométrica",
   "meanSigma":"Media sigma",
   "naturalBreaks":"Rupturas naturales",
   "quantile":"Cuantil",
   "colorRamp":"Rampa de color",
   "initial":"Inicial",
   "final":"Final",
   "cake":"Tarta",
   "tDcake":"Tarta 3D",
   "donut":"Donut",
   "graphic":"Gráfico",
   "classic":"Clásico",
   "dark":"Oscuro",
   "pale":"Pálido",
   "neon":"Neón",
   "pie":"Pastel",
   "xAxis":"Eje X",
   "yAxis":"Eje Y",
   "addAttribute":"Añadir atributo",
   "bevel":"Bisel",
   "miter":"Inglete",
   "rounded":"Redondeado",
   "extreme":"Extremo",
   "square":"Cuadrado",
   "labelText":"Etiqueta",
   "icon":"Icono",
   "stroke":"Trazo",
   "center":"Centro",
   "justified":"Justificado",
   "left":"Izquierda",
   "right":"Derecha",
   "alphabetical":"Alfabetico",
   "down":"Abajo",
   "hanging":"Colgando",
   "ideographic":"Ideografico",
   "up":"Arriba",
   "patternOptions":"Opciones de patrón",
   "adjust":"Ajustar",
   "ranges":"Rangos",
   "flowLine":"Línea de flujo",
   "absolute": "Absoluto",
   "arrow": "Flecha",
   "arrowColor": "Color flecha",
   "generateSerialized": "Generar estilo serializado",
   "serializedStyle": "Estilo serializado",
   "clipboard":"Copiado estilo serializado en el portapapeles",
   "modifySVG": "Modificar SVG",
   "infoURL": "Se encuentra disponible una galería de ficheros SVG en <a target='blank' href='https://componentes.cnig.es/api-core/api/actions/resources/svg'>https://componentes.cnig.es/api-core/api/actions/resources/svg</a>",
   "tooltip": "Gestor de estilos"
}