{
  "exception": {
    "impl": "The implementation used cannot create HelpControl controls."
  },
  "textHelp": {
    "help1": "This tool allows you to create an HTML page on the fly with the help of plugins and controls that have implemented the 'getHelp' method to obtain help from each of them.",
    "help2": "It also allows you to display extra content added by the user to the help."
  },
  "tooltip": "Help",
  "help": "Help",
  "short_title": "API-CNIG Help",
  "long_title": "API-CNIG Help",
  "tools": "Tools",
  "welcome0": "Viewer made with the API-CNIG",
  "welcome1": "CNIG API is a tool that allows you to easily integrate an interactive map viewer into any web page and configure it by consuming WMC files, WMS services, WFS services, KML files, etc. In addition, it provides the ability to add a lot of tools and controls.",
  "welcome2": "API-CNIG code",
  "welcome3": "Link to repository",
  "welcome4": "Plugin Gallery",
  "welcome5": "Link to plugin gallery",
  "welcome6": "Link to the API-CNIG Wiki",
  "welcome7": "Example Gallery",
  "welcome8": "Link to gallery of examples",
  "welcome9": "Training Resources",
  "welcome10": "Link to training resources",
  "tools1": "The API-CNIG has a series of tools that allow you to interact with the information offered in the viewer:",
  "tools2": "Controls are the tools that the map includes and that allow you to work with it. For example, we can have a control that draws the scale on the map, another that offers a selection of base layers for the background of the map, another that shows the coordinates of the cursor, etc.",
  "tools3": "Plugins or extensions are functionalities that offer specific utilities that, unlike basic controls, are usually used in specific scenarios, so they are separated from the core or main core of the API so as not to penalize downloading. who doesn't need them.",
  "tools4": "For example, those controls that, although offering different atomic functionalities, work as a group on the same vector layer would be grouped in the same plugin. In this way, the management of the information and the common elements that they share are optimized. .",
  "write": "Write here",
  "search": "Search",
  "pdf": "Download as PDF"
}