{
  "exception": {
    "impl": "The implementation used cannot create Infocoordinates controls."
  },
  "textHelp": {
    "help1": "Click on the map to obtain the coordinates of a point in the selected reference system.",
    "help2": "If you click on multiple places you can get the coordinates of multiple points.",
    "help3": "1. CRS. Select the coordinate system in which the coordinates of the points are displayed. The coordinates are displayed both projected and geographical. The latter can be displayed in decimal notation as well as sexagesimal.",
    "help4": "The reference systems and projection systems available are the official ones for the national territory:",
    "help5": "For the Peninsula and the Balearic Islands.",
    "help6": "For the Canary Islands.",
    "help7": "Additionally, coordinates are offered in EPSG 3857: WGS 84 / Pseudo-Mercator, which are beginning to be common in some geographic viewers, although they are not official in Spain.",
    "help8": "2. Point information. You can check the coordinates of each point by clicking on the corresponding number in the 'Coordinate Information' panel.",
    "help9": "3. Delete point. Delete the current point.",
    "help10": "4. Delete all points. Delete all points and restart the numbering.",
    "help11": "5. Show coordinates on screen. Show or hide the coordinates of points on the map.",
    "help12": "The information relevant to the extension and its possible parameterization is documented in",
    "help13": "The example of use of its parameters can be checked in"
  },
  "tooltip": "Coordinates Information",
  "title": "Coordinates Information",
  "point": "Point:",
  "datum": "Datum:",
  "latitude": "Latitude:",
  "longitude": "Longitude:",
  "formatCoordinates": "DMS",
  "coordX": "Coord.X (m):",
  "coordY": "Coord.Y (m):",
  "altitude": "Altitude (m):",
  "readingAltitude": "Reading...",
  "noDatafromWCS": "No data",
  "removePoint": "Removes point",
  "copyLatLon": "Copy latitude/longitude",
  "copyxy": "Copy x/y",
  "removeAllPoints": "Remove all points",
  "importAllPoints": "Export all points",
  "copyAllPoints": "Copy all points",
  "displayONAllPoints": "Show coordinates of all points",
  "displayOFFAllPoints": "Hide coordinates of all points",
  "clipboard": "Result copied to clipboard"
}