{
  "exception": {
    "impl": "The implementation used cannot create PrintViewManagementControl.",
    "impl_printermap": "The implementation used cannot create PrinterMapControl.",
    "no_controls": "The PrintViewManagement plugin needs to activate at least one control.",
    "encode": "The implementation used cannot use encodeLayer.",
    "error": "An error has occurred while printing.",
    "imageError": "The download could not be completed at this time. Please try again later.",
    "error_layers": "The following layers will not be displayed when printing the map: ",
    "teselaError": "The request has caused an error in printing. < br / > Please try again.",
    "printError": "Printing has failed.",
    "encode_method": "The used implementation does not have the encodeLayer method",
    "tile": "The request for some tile has caused a printing error. <br/>Please try again.",
    "support": "MBTiles and MBTilesVector layers are not supported",
    "error_download_image": "The download could not be completed at this time.",
    "loaderror": "Base64 generation Error"
  },
  "textHelp": {
    "help1": "The print extension allows you to export both maps from templates and georeferenced images.",
    "help2": "The extension is customizable, so it can change from one viewer to another.",
    "help3": "Using the print map control, you can download a map based on a selected template, a DPI (Dots per inch, the printing resolution), and a format. It also allows you to add a title and a description." ,
    "help4": "To obtain the map, you will have to click on the download button, which will cause the document to be generated and appear available for download.",
    "help5": "The map is currently downloaded to EPSG:3857 (WGS84 / Pseudomercator).",
    "help6": "Through the georeferenced image download control through the view, a georeferenced image can be obtained next to the georeference file.",
    "help7": "The available options are: add a title to the file, select the format, obtain the georeferencing file, select the DPI (in case of using download through services) and select the type of download.",
    "help8": "The download by view takes a snapshot of the viewer map, obtaining the layers loaded at that moment and the state of the map. The coordinate system of the download will be the coordinate system and/or projection of the map in that moment.",
    "help9": "The download of layers loaded by services makes a call to the services themselves creating an image of their set. The coordinate system will be WGS84 / Pseudomercator (EPSG:3857).",
    "help10": "The download control of georeferenced images by list allows you to download different WMS services with different coordinate systems and projections, indicated when building the extension.",
    "help11": "The extension of the image of the display state at that moment is obtained, and a request is made to the service with the assigned projection",
    "help12": "The information relevant to the extension and its possible parameterization is documented in",
    "help13": "The example of using its parameters can be checked in"
  },
  "tooltip": "Map printing",
  "map_printing": "Map printing",
  "nextView": "Next view",
  "previousView": "Previous view",
  "service_epsg": "Service EPSG",
  "georeferenced_img": "Georeferenced image",
  "format": "Format",
  "errorProjectionCapabilities": "The selected projection is not available for this base layer. Please choose another projection.",
  "printInfor": "Print generated by Mapea",
  "generating": "Generating georeferenced image",
  "referenced": "Georeferenced image",
  "projection": "Projection",
  "downImg": "Download Image",
  "downMap": "Download Map",
  "delete": "Delete",
  "down": "Download",
  "title": "Title",
  "notitle": "(No title)",
  "cancel": "Cancel",
  "accept": "Accept",
  "download_modal": "The use of the information of the geographic data products and services defined in the <a tabindex=\"0\" target=\"_blank\" href=\"https://www.boe.es/boe/dias/2015/12/26/pdfs/BOE-A-2015-14129.pdf\">Order FOM/2807/2015</a>, as well as its derivatives, entails the acceptance by the user of the general conditions of said order, specified in the following <a tabindex=\"0\" target=\"_blank\" href=\"http://www.ign.es/resources/licencia/Condiciones_licenciaUso_IGN.pdf\">license of use</a>, compatible with CC-BY 4.0.",
  "use_license": "License of use",
  "map": "Map",
  "pnoa": "Image (PNOA)",
  "screen": "Screen Image",
  "fixeddescription": "This document has no legal validity",
  "description": "Description",
  "layout": "Layout",
  "credits": "Print generated through api-core",
  "base": "Base Cartography",
  "zone": "zone",
  "georefimageWld":"Georeferencing file (WLD)",
  "typeDownload":"Select the type of download:",
  "typeClient": "Screen view download",
  "typeServer": "Downloading layers loaded by services",
  "selectLayer": "Select the layer to download",
  "clipBoard": "Copy to clipboard",
  "layer_wms": "WMS returns a map in image format from a set of raster or vector layers. Allowing customization of layers through styles.",
  "layer_wmts": " WMTS (Web Map Tile Service) es un estándar OGC para servir información geográfica en forma de tiles pregenerados a unas resoluciones específicas.",
  "layer_tms": "TMS (Tile Map Service) layers are geographic information services in the form of tiles very similar to XYZ layers.",
  "layer_xyz": "Las capas XYZ son servicios de información geográfica en forma de tiles. Cada tile representa una combinación de tres parámetros.",
  "layer_raster": "Layers raster:",
  "layer_vector": "Layers vector:",
  "layer_geojson": "Despite not being an OGC standard (it is on its way to becoming one), it is a very widespread geographic information exchange format that, like WFS, allows all the elements to be on the client.",
  "layers_wfs": "(Web Feature Service) is an OGC standard for the download and transfer of geographic information, where the geographic elements or features are transmitted in their entirety to the client.",
  "layers_kml": "(Keyhole Markup Language). KML is an XML-based markup language for representing geographic data in three dimensions.",
  "layer_OGCAPIFeatures": "(OGC API - FEATURES) is an OGC standard that provides the ability to create, modify, and query spatial data on the Web and specifies requirements and recommendations for APIs that want to follow a standard way of sharing feature data.",
  "tooltip_georefimageepsg": "EPSG code of the georeferenced image",
  "title_map": "Map printing",
  "title_view": "View georeferenced image download",
  "title_list": "Download georeferenced image from list",
  "available_sources": "Available sources",
  "maintain_view": "Maintain print view with DPI = 120"
}
